class Constants:
    CAR_CONDITIONS = ["جديدة", "مستعملة", "مستعملة بحالة جيدة", "تحتاج صيانة"]
    TRANSACTION_TYPES = ["بيع", "شراء", "حجز", "صيانة"]
    CLIENT_STATUSES = ["بائع", "مشتري", "حجز سيارة", "عرض سيارة"]
    
    CAR_BRANDS = {
        "تويوتا": ["كورولا", "كامري", "لاندكروزر", "هايلكس", "RAV4", "يارس"],
        "هيونداي": ["إلنترا", "سوناتا", "توسان", "كريتا", "اكسنت", "فيرنا"],
        "نيسان": ["صني", "سنترا", "التيما", "قشقاي", "باترول", "تيدا"],
        "شيفروليه": ["أفيو", "كروز", "أوبترا", "لانوس", "كابتيفا"],
        "كيا": ["سيراتو", "سبورتاج", "بيكانتو", "سورينتو", "ريو"],
        "مرسيدس": ["C180", "C200", "E200", "E300", "S400", "GLC"],
        "بي إم دبليو": ["الفئة 3", "الفئة 5", "الفئة 7", "X3", "X5"],
        "أودي": ["A3", "A4", "A6", "Q3", "Q5", "Q7"],
        "فولكس فاجن": ["باسات", "جيتا", "تيجوان", "جولف"],
        "سكودا": ["أوكتافيا", "كودياك", "سوبيرب", "فابيا"],
        "بيجو": ["301", "3008", "508", "2008", "208"],
        "رينو": ["لوجان", "داستر", "ميجان", "كادجار", "سانديرو"],
        "فيات": ["تيبو", "500", "دوبلو", "لينيا"],
        "ميتسوبيشي": ["لانسر", "باجيرو", "إكليبس", "L200"],
        "مازدا": ["3", "6", "CX-5", "CX-9"],
        "هوندا": ["سيفيك", "أكورد", "CR-V", "HR-V"],
        "سوزوكي": ["سويفت", "فيتارا", "إرتيجا", "ألتو"],
        "بروتون": ["ساجا", "إكسورا", "بيرسونا"],
        "جيلي": ["إمجراند", "باندينو"],
        "شيري": ["تيجو", "أريزو", "إنفي"],
        "بي واي دي": ["F3", "L3", "S6"],
        "جريت وول": ["هافال H6", "هافال H9", "وينجل"],
        "ام جي": ["MG5", "MG6", "ZS", "RX5"],
        "جاك": ["S3", "S4", "S5"]
    }
